#!/usr/bin/env python

def main():
    """
ウォーモンガーたみ子VSドクトル・デスマッド


柳生十兵衛襲来の半年前


北町田　デスマッド要塞タワー



要塞タワーの各所から突き出たパラボラレーザー砲から、大量のレーザーが地面に向けて放たれる。



目標はタワーに向かう崩壊アスファルト道路をローラーダッシュで駆ける、一人の少女だ。



「んニャロ…！」


少女は自身の脚部にシナプス直結された踵ローラーで急激な加減速ドリフトを繰り返し、数十の屈折レーザーの隙間を縫い、それらを避けきる。


「ンン～～～！さすがはウォーモンガーたみ子さん、凄いですねェ、怖いですねェ！それでこそ私の最高傑作ですよォ！」


タワー最上部に設置された威嚇用スピーカーの集合体から、男の甲高い声が響いた。


同時に要塞タワー中腹から四発の対人ミサイルが発射される。



「わっ、ヤババ！…って効くわけねえだろ！ナメてんのかボケ！」


たみ子は前進の勢いを殺さず回転、背中にマウントしていた大型ガトリングガンを前部展開し、右腕に直結接続し、そのまま１８０°ドリフト方向転換！急速後退でミサイルと相対距離を保ちながらガトリング迎撃！



BOOOOOOOOORRRRR！



銃声が一繋ぎになるほどの連射速度で発射された弾丸の嵐がミサイルを四発とも粉砕！


「強行戦闘フォームの反応速度は上々！機動力と火力のバランスもイイですねェー！素晴らしいですよォ、たみ子さん、そして私！」



「アーシに脳天ブチ抜かれてもまだそんな呑気こいてられるか、試してやっよ！！」


そう叫びつつ、塔にガトリング砲口を向けた。


◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆



「クソッ、何が足りねえんだ…」


私は小石を蹴りながらトボトボと隠れ家に向けて帰る。


今日の戦闘で弾薬もあらかた使い果たしてしまった。デスマッドの要塞の迎撃機構にもそれなりの消耗を与えられた…とは思うが、自信はない。有効打を与えられた感覚はまるでなかった。



私はウォーモンガーたみ子。今はバトルサイボーグやってる。前はこうじゃなかった。町田に住んでる普通の女子高生だった。喧嘩、インターネット、インターネットで喧嘩。平和な日常。



「素晴らしい素質ですねェ！適任ですねェ！何より名前が良い！迫力がある！キキーッ！！」


ウォーモンガーって苗字がいけなかった。その響きのせいで、あのキチガイ博士に目つけられて、今じゃ全身兵器だ。


物心つく前に両親も死んでて、心配する奴が一人もいないのはまだマシだったかもしれねえ。（そうだよ、友達もいなかった）


脳味噌をドリルでかき回される前になんとか逃げられたのは良かったが、このナリじゃ銭湯はおろか、スーパー銭湯にも行けやしねえ。　


◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆



「姉御じゃん！また負けたの！？」


「姉御って言うな…負けてもねえよ」


寝ぐらの近くに住んでるクソガキだ。名前をアキラとか何とか言った。


「でも、やっつけてないんだろ？じゃあ負けと一緒じゃん！」


可愛くねえガキだ。私はアキラを無視して、バラック小屋に戻った。


今日はふて寝の気分だ。



「いつも考え無しに真正面から突っ込んでるから勝てないんだよ。なんかもっと工夫とかしたら？角度とか。これで６回目だっけ？」


「ガキが知った口聞きやがって…苦手なんだよ、そういうの…５回目だ」


「ま、オイラにゃ関係ないからいいけどさ…」


そういいながら、アキラは当然のように小屋に上がり込む。



「なんでアーシに付きまとってくんだよ、邪魔だ」


私はアキラを小突くが、出ていく気配がまるで無い。


「姉御そこそこ強いから一緒にいると雑魚にゃ絡まれねえしさ、それに人間のメシ食わねーからオイラのメシ取られる心配もないし」


「ま、その点は否定しねえな」


私はジャンクヤードから拾ってきたノートPCに噛り付きながら答える。この体になって悪くないのはメシの調達が楽ちんなことだ。



「それにロボたぁ言え、姉御ほどの美人の尻追っかけねえ道理がねえや、眼福眼福」


「そ、そうか…？ま、それも否定しねえけどさ…タハハ…」


「それに姉御めちゃくちゃチョロいし、情に流されるタイプっぽいしさ。オイラが誰かに捕まったらなんだかんだブツクサ言いながら助けにくるタイプだろ？」


「絶対ェ助けねえからな、目の前でぶっ殺されててもほっとく」


アキラに背を向けて横になる。



その内アキラの寝息が聞こえてきても、私の中では今日のこと、これまでのこと、これからのことがグルグルと回り続ける。


薄々わかっちゃいた。私の体はあのクソが作ったものだ。


繰り返しても新しい目が出る気はあんまりしなかった。


しなかったが、かといってやり方を変えるのも億劫だった。続けてりゃどうにかなるかもしれねえだろ。



◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆



「で、また２０敗目の記録更新っと。懲りないね、姉御も」


「２０分け目だ…その肉焼けてるぞ」


路上で肉（何かはわからない）を焼くアキラの横で、ジャンクヤードから拾ってきたゲーミングPCを丸かじりする。七色に光るゲーミングPCは体に悪そうだが、栄養価は高かった。


「もういいじゃん、デスマッドもなんか本気感ないしさ…オイラたちとプロ置き引き目指した方が絶対儲かるよ。その足のローラーとかさ、置き引きするために生まれたような体じゃん！」


「…考えとくよ」


半ば本心から出た言葉だった。


「アレ！？姉御が珍しく素直…！？なんかオイラの方が拍子抜けしちまうな…」


「今日はテンションが上がんねんだよ」


アキラを置いて立ち上がる。　


「どこ行くんだよ姉御！？」


「ジャンクヤードだよ…食い足りねえ」



一人ジャンクヤードに着いた私はガラクタを物色する。大味な機械は腹が膨れるだけでどうしようもない。集積回路が入ってるような奴がいいが、それはここらじゃ貴重品だ。


「お、これなんかいいじゃねえか…」


携帯ゲーム機を手に取った時、元居た方角から大きな爆発音が連続的に響いた。


慌てて戻った私を、例の甲高い声が迎える。


「バラック街は良く燃えますねェー！」



逃げ惑う住民を跳ね飛ばしながら、ドラム缶から手足がそのまま生えたようなシンプルなシルエットの大群が炎に包まれるバラック街を進軍する。デスマッドのロボット軍団、デスボットだ。


「ンンー！たみ子さん！あなたは攻めきれない！わたしは追撃が億劫！このままでは手詰まりですねェー、面倒ですねェー！そこで思いつきました！」


デスボットの一体が、腹部の収納シェルターを展開する。


そこには、囚われたアキラの姿があった。


手足を狙って護身用の腕内蔵スタンライフルで銃撃するが別のデスボットが身代わりになりそれを防ぎ、アキラを捕らえたデスボットはすぐに大軍の向こう側へと消えていく。



「クソが…！」


「たみ子さんー！この後の展開はもうお分かりですねェー！次をクライマックスにしましょう！あなたが次にまた芸も無く退散していったら、この少年を酷い目に合わせますねェー！」


「アーシが助けにいかなかったらどーする？そんなガキにゃ縁も義理もねえぜ」


「酷いや姉御！この人でなし！メガネ！三白眼！ギザ歯！」


アキラの声が無線スピーカーで広がる。



「ンンー！ご存知の通りわたしは子供を殺すのは好みませんねェー！ただし、彼には私の工場で働いてもらいますねェー！あなたが助けに来なければ、彼の貴重でかけがえのない少年時代は刻一刻と失われていきますねェー！成人年齢になった瞬間に過労死するように調整して過重労働を課します！」


「いやだー！働きたくない！ずっと置き引きと賽銭ドロだけして楽しく暮らすんだー！姉御、助けてー！」


声が遠ざかっていく…


◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆



町田共同墓地


『ウォーモンガー家の墓』と書かれた墓石の前に私は雨の中立っていた。


両親に思いがある訳じゃなかった。それでもこの名前は親につけられたもんだ。


ひょっとして名前が平凡だったらあのキチガイ博士に目をつけられることもなかったかもしれない。全くいい迷惑だ。


だけど。



手を握り締める。これはもう私の手じゃない。奴に作られたマシンアームだ。



だけど。





◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆



数　ヶ月　後（FEW MONTHS LATER）



デスマッド要塞タワー



全方位からの長距離ミサイルの同時攻撃を、要塞の防空機銃が迎撃する。


防空機銃をすり抜けたミサイルも、要塞の周囲を回転する浮遊シールドマトリクス板群に阻まれる。



操車場跡地でそれを見ながら私は頷く。ここまでは予定調和だ。この町一帯にヤツの監視を掻い潜ってミサイル発射設備を仕込むのは骨だったが、タワーの防衛ロジックに多少の負荷がかけられれば、それで十分。



「第二段階！行くぞオラァッ！」


ミサイルの雨が引き続きタワーに殺到するのを背景に、偽装用の廃列車が展開し、列車サイズの超長距離砲撃用プラズマスナイパーカノンが姿を見せる。巨大な砲身の根元横に据え付けられた足場に私は飛び乗る。


右腕部を肩から取り外し、プラズマスナイパーカノンの中枢部と右肩からシリンダー直結。左眼球が180度回転し、スコープモードに展開変形する。


「一発派手に…今！」


付近の電磁廃材や電磁浮浪者をイオン溶融させるほどの出力で、暴力的エネルギーの奔流が放たれた。ミサイルの対応に処理速度を奪われていたシールドマトリクス板群の隙間を抜け、デスマッドタワーに直撃する！



辺り一面の市街地を激しく照らし、周囲にプラズマ雷光が拡散する。


光が落ち着いた時、デスマッドタワーは…無傷だった。塔身本体もまた、不可視シールドに覆われている。


だが次の瞬間、タワーの周囲のシールドマトリクス板が次々と落下していき、タワーの照明が消えていく。


シールドジェネレーターの過負荷により、エネルギーコアがダウンしたはずだ。


「コレで屈折レーザーやメガ主砲バスターはしばらく使えねえ！一気にキメるぞコラ！」


右肩とプラズマスナイパーカノンを切り離すと、私は切り札のところに向かった。



◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆


廃校。私が昔通ってた高校だ。


いい思い出は大してないが、今はOB（中退だけど）の為に役立ってくれてる。


「起ッ動ォォォォォォォ！！」


叫びに反応して偽装用の廃体育館が展開し、体育館サイズの巨大な兵装ユニットが姿を見せる。



大量のウェポンコンテナ。


長大な主砲。


それらをむりやり纏めて飛ばすための巨大な推進バーニア。


異形の形状。



開かれたユニット中心部に乗り込むと、ユニットと私がニューロ脊髄直結される。


刺すような一瞬の頭痛の後、身体が拡張される爽快感に震える。


網膜ディスプレイに情報が表示される


『メインバーニア:サイコー


　スラスター:サイコー


　主砲240mmキャノン：サイコー


　右兵装モジュール:サイコー


　左兵装モジュール:サイコー


　迎撃システム:サイコー


　メインフレーム強度:サイコー』



「試運転もバッチリ、お膳立ても完璧、ここまでやりゃあよ、あとは突っ込むだけしか残ってないよな！」


網膜ディスプレイはデスマッドタワーまでの航路をホログラフィック表示で示す。


「3.2.1.ファイア！」



バーニア噴射で廃体育館を吹き飛ばしながら、私はタワーに向かって飛んでいく。



ウォーモンガーたみ子　拠点襲撃用超重兵装飛行機動装甲フォーム≪メガロマニア≫、出撃！！！



◆



デスマッドタワーに近づくが、迎撃は飛んでこない。エネルギーコアはダウンしたままだ。


悠々とタワーの至近距離に近づき、ホバリング静止する。



メガロマニアの前面装甲板を展開し、ユニットに下半身まで埋まった私の姿を晒す。挨拶はしとかねえとな。


「よお、ガキが世話になってるな？連れ帰りにきたぜ、ついでにアンタもぶっ殺す」



緑横線ホロモニターがタワーの前に投影され、デスマッドが映る。


「見たことが無いフォームですねぇー！？私はそんな機能を加えた覚えはないんですねェー！？」


禿頭に丸ゴーグルのデスマッドが、マッドサイエンティスト特有の指ワキワキ動きをしながら応える。


「作ったんだよ！アーシがな！！」


「作った！？おかしいですねェー！？あなたの体内のナノコンストラクターセルはまだ起動反応がありませんねェ！？自己進化思考連動兵装自動生成システムもまだ使えないはずですねェー！！筋が通りませんねぇー！？奇妙ですねェー！！」


「ごちゃごちゃウルセえ！ガキはどうした！？」


「アキラ君はなかなか覚えが良いですねぇー！単純肉体労働酷使しようと思っていましたが、今では優秀な助手ですねェー！健康状態も以前よりむしろ快調ですのでご安心を！」


カメラが横にパンし、アキラが映った。その血色は確かに以前より良い。


「あ、あ、姉御ー！何してたんだよー！もう科学実験の手伝いばかりの規則正しい生活は嫌だよー！食事も野菜中心の健康的なメニューなんだ！ジャンク路上肉が食べたい！置き引きしたい！」


「すぐ助けてやっから待ってろ！巻き添えになるんじゃねえぞ！」



装甲板を閉じ、再びメガロマニアの内部に格納される。


挨拶は終わった。ブッ殺しの時間だ。



ユニット下部にマウントされた240mmキャノンがオーバーヒートギリギリのスパンで徹甲弾を集中連射する。タワー中腹、デスマッドの居る司令ラボまでの装甲板を一気にブチ抜いて、サッサとケリを付けたい。



「イー」「イー」「イー」「イー」


デスマッドタワー各所の窓が展開し、デスボット軍団がライフルやRPGで迎撃してくる。


「迎撃モード！」


ユニットの各部に据え付けられた十二門の対歩兵機関砲がそれぞれに自動照準で狙いを定め、銃弾の濁流でデスボッド軍団を金属片に変えていく。主砲の連射はその間も止まらない。


「グエー」「グエー」「グエー」「グエー」



デスマッドタワー表面に翠の光芒が走る。同時に、タワー各所からレーザーやミサイル砲塔が展開される。リアクターコアが復旧した、早くケリをつけないと不味い。


こちらを狙ってくるレーザーの束を、推力頼みの強引な空中軌道で紙一重に避けながら、反撃態勢を取る。


左右のウェポンコンテナが展開し、ミサイルラックが展開した。


一斉に射出された大量のミサイルは納豆めいた後部軌道煙を複雑に絡ませ、一部は敵ミサイルと相殺爆破しながらも大半がタワーの砲台に直撃する。


爆炎が空を覆い、視界がホワイトアウトする。デスマッドタワーの兵装の大半は沈黙した。 その間に完全に照準制御された240mキャノンはタワーの中腹への集中射撃を続けている。遂に装甲にヒビが入る！



「ムムム…正直お見事…ジリ貧ですねェー…不味いですねェー」


デスマッドの声がスピーカー越しに響く。


「なので、こちらも切り札ですねェー！」


タワー中腹のヒビ割れ装甲が吹き飛ぶ！その奥から出てきたのは、デスマッドを模した巨大な顔面！


「おい、まさか」


「そのまさかですねェーッ！本来は柳生空中艦隊と戦うための決戦兵器でしたが！たみ子さんの奮闘に敬意を表して先行お披露目ですねェーッ！！」



タワー全体が激しく振動した！


タワー上部が展開し、二本の腕に！


手首がスライド登場！


タワー下部が中央で分割し、二本の脚に！


胸部にあたる箇所が反転し、ライオンの顔を模したエンブレムが現れる！


両腕を顔の前にクロスさせ、力を溜めた後振り下ろす！


同時に顔面にバトルマスクが装着されてよりロボめく！


「インサニティ・フォームアップ！デスマッドタワー、強行型モード！超巨大合体、キングデスマッドですねェーッ！！！」


「合体はしてねーだろ！！」


「カッコイイでしょうーッ！！！」



キングデスマッドが足を踏み出す。地響きが起こり、周囲のバラック群が次々と倒壊していく。


「ウワーッ！！」「家がーッ！！」


今までの大騒ぎには全く動じなかった周辺住民も、これには流石にビビって家から飛び出してくる。


「マジでヤベェな！キチガイ博士め！」


キングデスマッドの大振りの右ストレートをバーニア噴射で躱す。が、


「こっちが本命ですねェーッ！」


避けた先に狙いすました左フックが飛ぶ！直撃！


「グアアアッ！！」


体勢を崩した機体が回転しながら吹き飛び、強力な遠心力で意識がブラックアウトしかける。


意識補助システムによる往復ビンタが辛うじて意識を引き戻す。


「デカブツの癖に…カウンターなんかしてんじゃねえ…！」



スッキリした頭で機体の状態を確認する


『メインバーニア:ヤバ


　スラスター:激ヤバ


　主砲105mmキャノン：撃てねえ


　右兵装モジュール:撃てねえ


　左兵装モジュール:ヤバ


　迎撃システム:無理


　メインフレーム強度:激ヤバ』


「いいの貰っちまった…長期戦はもうキツいな」



デスマッドが街を踏み潰しながら近づいてくる。


残ったミサイルは発射できない。辛うじて一門生き残った迎撃機関砲が射撃を続けるものの、まるで意に介さない。


両腕が伸びてくる、スラスターの急速噴射が…できない！


「捕まえましたねェーッ！」


「グウッ…！」



キングデスマッドの両腕が、こちらの全身を押しつぶそうとし、メインフレームが悲鳴を上げる。


「素晴らしいですたみ子さん！さすが私の最高傑作！！！今からでも遅くありません！私のところに戻って共に柳生と戦い！ともに世界を支配しましょう！」


「願い…下げだね！」


スラスターをオーバーロード出力上昇させる！爆発！


「おおっと！」


デスマッドの腕が外れる！


「アキラ！巻き添えになるんじゃねえぞ！」


左右の兵装モジュールそのものをメインフレームから射出！それ自体が巨大な爆発赤ドラム缶と化した巨大質量がキングデスマッドの顔面に向かう！



巨大爆発！



極度圧力で辺り一帯が真空状態となり、空気のバックラッシュ流れ込みが生じる！


それに乗り、メインバーニアが最後のフル推力！



キングデスマッドの顔面には大穴！その奥には、ドクトル・デスマッド本体！



デスマッド顔面からの最終防衛触手ドリルがメガロマニアのユニット全体を貫いていく。


ユニットの前面装甲を展開！緊急脱出装置が作動し、私の体が打ち出される。


「アーシはアンタの最高傑作じゃねえ…アーシの最高傑作だ！」


空中で体勢を整え、飛び蹴りの姿勢になる。脚部ローラーからチェーン刃を展開、高速回転！


最高速度のまま、キングデスマッド顔面の穴に飛び込む！



私の蹴りが、ドクトル・デスマッドの胴を貫いた。



◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆




「グ…ググ…無念ですねェ…辛いですねェ…」


上半身だけのデスマッドが呻く。内臓の代わりに様々な電子機器が見える。


「たみ子さん…教えてください…あなたの自己進化思考連動兵装自動生成システムはまだ覚醒していないはず…それなのにどうしてあれほどの戦闘ユニットを…誰か…わたしの他に協力者が…？」


「勉強したんだよ」


私は腹部収納モジュールから、本の束を取り出した。


『よくわかる電子工作』


『はじめてのC言語』


『できる！金属加工』


『ゼロからスタート！殺人兵器』


デスマッドの目が見開かられる。


「どれも…わたしの…著作ですねェー…わかりやすかったでしょう…？」



「ムカつくけど、アンタのミームもアーシの一部だ」


私はデスマッドの横に座り込んだ。


「アンタ、自分からはアーシを殺そうとはしてこなかったよな。アーシを試してたのか？」


「それは全くの間違いですねェー…！？私は君の能力が"覚醒"することを期待していましたが、君は自力で"成長"してしまいました…全く、期待以上の成果でしたねェー！」


「アーシはこれから気持ちよく生きていく、顔も知らねえ親から受け継いだウォーモンガーって名前もこのツラも、アンタに押し付けられた機械の体もアンタから学んだミームも全部呑み込んでな。だから安心してくたばれ」


「それは…本当に…楽しみ…で…す…ネェー…」


デスマッドの右目の赤ランプが明滅し、そして消失した。



キングデスマッドが膝をつき、地響きが起き、そして完全に収まった。


ようやく辺りは静かになった。



「姉御！」


ラボの机の下からアキラがはい出してきた。


「良く生きてたなお前！」


「普通死ぬよ！それより、やっぱり助けに来てくれたんだね！デヘヘ、オイラの言った通りだね、チョロイや」


「うるせえ！」


爪先蹴りをアキラの腹にめり込ませる。


「ウゴッ…照れ隠しが…ガチすぎる…それよりこれから…どうするの姉御…」


「お前、デスマッドの助手やらされてるっていったよな」


「う、うん」



「それなら…」


私は息を吸って、突っ込んできた大穴から外を見た。夕陽が沈もうとしている。叫んだ。


「今からここをアーシ達の新たな根城にする！デスマッドの遺産も技術も全部頂きだ！近くの浮浪ガキ全員攫ってこい！過労死はさせねえ！週休２日！置き引きは土日に勝手にやれ！アーシが戦う！お前らが後方支援！町田もこの国もアーシらのもんだ！」


「ふぇぇ…」


マジでイヤそうなアキラのツラが見えた。知ったこっちゃねえ。


アーシは冷酷無慈悲なバトルサイボーグ・ウォーモンガーたみ子だからな。


「ウォーモンガー一家、旗揚げだ！」



（ウォーモンガーたみ子VSドクトル・デスマッド　おわり）
"""
    print(main.__doc__)

if __name__ == "__main__":
    main()
